#+INCLUDE: "baslik.org"
** 3.ders
   #+BEGIN_SRC emacs-lisp
     (setq my_list '(1 2 3 4))
     ;; loop through list and print even number
     (dolist (elm my_list)
       (when (= (mod elm 2) 0) 
         (print elm) ;; writes to mini buffer
         (message (number-to-string elm)) ;; durumu tam anlamadım
         ))
     (let (some-var) ;; sets scope, some-var will work only in let
       (when (null some-var)
         (message "var is null") 
         ))

     (let ((some-var 0)
           (other-var 99))
       (if (null some-var)
           (message "null")
         (message "not null")
         ))

     (defun sum-evens (some-list)
       (let ((sum 0))
         (dolist (elm some-list)
           (when (= (mod 2 elm))
             (setq sum (+ sum elm))))
         (message (number-to-string sum))
         ))
     (sum-evens '(1 2 3 4))
   #+END_SRC

   #+RESULTS:
   : 10

